BibliotecaDistribuida/Test-JMeter/Muestreador BeanShell.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de Pruebas" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">C:\Users\Santiago\Documents\UNIVERSIDAD\Biblioteca Distribuida\ProcesoSolicitante\procesoSolicitante.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo de Hilos" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">15</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">// Definir los parámetros
String ipGestor1 = &quot;localhost&quot;;
String ipGestor2 = &quot;localhost&quot;;
String pathArchivosRequerimientos = &quot;C:/Users/Santiago/Documents/UNIVERSIDAD/Biblioteca Distribuida/Test&quot;;
String puertoGCS = &quot;5555&quot;;


// Guardar los parámetros en JMeter Variables
vars.put(&quot;ipGestor1&quot;, ipGestor1);
vars.put(&quot;ipGestor2&quot;, ipGestor2);
vars.put(&quot;puertoGCS&quot;, puertoGCS);
vars.put(&quot;pathArchivosRequerimientos&quot;, pathArchivosRequerimientos);</stringProp>
        </BeanShellPreProcessor>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Muestreador BeanShell" enabled="true">
          <stringProp name="BeanShellSampler.query">import co.edu.javeriana.test.ProcesoSolicitanteTest;

ProcesoSolicitanteTest a = new ProcesoSolicitanteTest();

// Obtener los valores de los parámetros desde JMeter Variables
String ipGestor1 = vars.get(&quot;ipGestor1&quot;);
String ipGestor2 = vars.get(&quot;ipGestor2&quot;);
String puertoGCS = vars.get(&quot;puertoGCS&quot;);
int puertoGC = Integer.parseInt(puertoGCS);
String pathArchivosRequerimientos = vars.get(&quot;pathArchivosRequerimientos&quot;);

// Obtiene el número de hilo correspondiente al orden de ejecución
int numeroHilo = ${__threadNum};
// Guarda el número de hilo en una variable local
int numeroHiloLocal = numeroHilo;
// Llamar al método miMetodo() pasándole los valores de los parámetros
a.iniciar(numeroHiloLocal, ipGestor1, ipGestor2, puertoGC, pathArchivosRequerimientos);</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Informe Agregado" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Árbol de Resultados" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>